# 다음 퀴즈를 수행하시오.

In [1]:
import pandas as pd
df = pd.read_csv("hotel_booking_train_1m.zip")
df.head(2)

,date_time,site_name,posa_continent,user_location_country,user_location_region,user_location_city,orig_destination_distance,user_id,is_mobile,is_package,...,srch_ci,srch_co,srch_adults_cnt,srch_children_cnt,srch_rm_cnt,srch_destination_id,srch_destination_type_id,is_booking,cnt,hotel_country
0,2014-07-07,11,3,205,354,25315,383.3362,163906,0,0,...,2014-08-04,2014-08-08,4,0,2,11569,1,0,1,50
1,2014-09-20,2,3,66,153,20706,2297.5172,201303,1,0,...,2015-01-01,2015-01-03,2,0,1,19137,5,0,1,128

In [2]:
pd.to_datetime(df["srch_ci"][:3]) - pd.to_datetime(df["srch_ci"][:3])

0   0 days
1   0 days
2   0 days
Name: srch_ci, dtype: timedelta64[ns]

### Q1. pandas 모듈을 pd로 불러오시오.

In [3]:
import pandas as pd

### Q2. "hotel_booking_train_1m.zip"을 pandas 모듈을 활용하여 불러오고 객체 종류를 확인하시오
(단, df 객체에 저장하시오)

In [4]:
import pandas as pd
df = pd.read_csv("hotel_booking_train_1m.zip")
df.head(2)

,date_time,site_name,posa_continent,user_location_country,user_location_region,user_location_city,orig_destination_distance,user_id,is_mobile,is_package,...,srch_ci,srch_co,srch_adults_cnt,srch_children_cnt,srch_rm_cnt,srch_destination_id,srch_destination_type_id,is_booking,cnt,hotel_country
0,2014-07-07,11,3,205,354,25315,383.3362,163906,0,0,...,2014-08-04,2014-08-08,4,0,2,11569,1,0,1,50
1,2014-09-20,2,3,66,153,20706,2297.5172,201303,1,0,...,2015-01-01,2015-01-03,2,0,1,19137,5,0,1,128

### Q3. df의 첫 5개 row를 출력하시오

In [5]:
df.head()

,date_time,site_name,posa_continent,user_location_country,user_location_region,user_location_city,orig_destination_distance,user_id,is_mobile,is_package,...,srch_ci,srch_co,srch_adults_cnt,srch_children_cnt,srch_rm_cnt,srch_destination_id,srch_destination_type_id,is_booking,cnt,hotel_country
0,2014-07-07,11,3,205,354,25315,383.3362,163906,0,0,...,2014-08-04,2014-08-08,4,0,2,11569,1,0,1,50
1,2014-09-20,2,3,66,153,20706,2297.5172,201303,1,0,...,2015-01-01,2015-01-03,2,0,1,19137,5,0,1,128
2,2014-10-23,2,3,66,442,35390,1139.8157,173990,0,1,...,2014-11-30,2014-12-07,2,1,1,11923,1,0,2,80
3,2013-11-07,37,1,69,923,54859,NaN,584851,0,1,...,2013-12-22,2013-12-27,3,0,2,18965,1,0,1,77
4,2013-02-24,2,3,66,311,5405,3279.1369,1154606,0,1,...,2013-03-01,2013-03-04,1,0,1,8253,1,0,1,70

### Q4. df의 마지막 2개 row를 출력하시오

In [6]:
df.tail(2)

,date_time,site_name,posa_continent,user_location_country,user_location_region,user_location_city,orig_destination_distance,user_id,is_mobile,is_package,...,srch_ci,srch_co,srch_adults_cnt,srch_children_cnt,srch_rm_cnt,srch_destination_id,srch_destination_type_id,is_booking,cnt,hotel_country
999998,2014-11-07,11,3,205,354,2875,1021.9359,192542,0,1,...,2014-12-08,2014-12-13,2,0,1,8268,1,0,4,50
999999,2014-01-14,40,3,66,184,11878,67.5305,543025,0,0,...,2014-06-05,2014-06-06,2,2,1,12196,6,0,1,50

### Q5. df의 차원을 확인하시오

In [7]:
df.ndim

2

### Q6. df의 row 개수를 확인하시오

In [8]:
len(df)

1000000

### Q7. df의 column 개수를 확인하시오

In [9]:
df.shape[0]

1000000

### Q8. df의 column 이름을 확인하시오

In [11]:
df.columns

Index(['date_time', 'site_name', 'posa_continent', 'user_location_country',
       'user_location_region', 'user_location_city',
       'orig_destination_distance', 'user_id', 'is_mobile', 'is_package',
       'channel', 'srch_ci', 'srch_co', 'srch_adults_cnt', 'srch_children_cnt',
       'srch_rm_cnt', 'srch_destination_id', 'srch_destination_type_id',
       'is_booking', 'cnt', 'hotel_country'],
      dtype='object')

### Q9. 데이터가 수집된 웹 사이트\[site_name\]의 개수를 조사하시오.

In [12]:
len(set(df["site_name"]))

42

In [13]:
len(df["site_name"].unique())

42

In [14]:
df["site_name"].nunique() # number of unique elements

42

### Q10. 데이터가 수집된 대륙\[posa_continent\]은 총 몇 개 인가?

In [15]:
df["posa_continent"].nunique()

5

### Q11. 유입 채널\[channel\]과 예약\[is_booking\]여부 데이터를 기반으로 표(crosstab)을 생성하시오.

In [16]:
pd.crosstab(df["channel"], df["is_booking"])

is_booking       0      1
channel
0           115153   9059
1            94389   6902
2            73920   4724
3            41934   2498
4            19034   2914
5            55890   5744
6             1540     82
7             7939    359
8             2689    243
9           508009  46798
10             168     12

### Q12. 각 검색 데이터를 유입 채널\[channel\]별 예약\[is_booking\] 비율을 계산하고 이를 cross 객체에 저장하시오.

In [20]:
pd.crosstab(df["channel"], df["is_booking"],
            normalize = 0).round(5) * 100

is_booking       0       1
channel
0           92.707   7.293
1           93.186   6.814
2           93.993   6.007
3           94.378   5.622
4           86.723  13.277
5           90.680   9.320
6           94.945   5.055
7           95.674   4.326
8           91.712   8.288
9           91.565   8.435
10          93.333   6.667

In [21]:
cross = pd.crosstab(df["channel"], df["is_booking"], normalize = 0)

In [23]:
0.99 * 0.99

0.9801

In [24]:
0.99 ** 10

0.9043820750088044

---------------------------
여기부터 cross 객체를 기준으로 문제를 해결하시오.

---------------------------
### Q13. 검색당 예약비율이 가장 높은 유입 채널은 몇 번인가?

In [26]:
cross.loc[cross[1] == cross[1].max(), ]

is_booking         0         1
channel
4           0.867232  0.132768

In [28]:
cross.sort_values(1, ascending = False).head(1)

is_booking         0         1
channel
4           0.867232  0.132768

In [29]:
cross[1].idxmax()

4

### Q14. 검색당 예약 비율이 가장 높은 유입 채널의 예약 비율을 소수점 셋 째 자리까지 반올림하여 구하시오.
(정답 예시: 0.456)

In [34]:
cross.loc[cross[1].idxmax(), 1].round(3)

0.133

In [33]:
round(cross[1].max(), 3)

0.133

### Q15. 유입 채널별 예약비율 정보를 "hotel_booking_info.csv"에 저장하시오.

In [ ]:
cross.to_csv("hotel_booking_info.csv", index = False)

### 16. 검색일과 최초 숙박일 까지의 남은 일수, 숙박일수, 사용자 위치로부터 숙박장소까지의 거리간 피어슨 상관계수를 산출하고 그 중 가장 높은 피어슨 상관계수 값을 반올림하여 소수점 둘 째 자리 까지 기술하시오. ~ 13:30

In [35]:
df.columns

Index(['date_time', 'site_name', 'posa_continent', 'user_location_country',
       'user_location_region', 'user_location_city',
       'orig_destination_distance', 'user_id', 'is_mobile', 'is_package',
       'channel', 'srch_ci', 'srch_co', 'srch_adults_cnt', 'srch_children_cnt',
       'srch_rm_cnt', 'srch_destination_id', 'srch_destination_type_id',
       'is_booking', 'cnt', 'hotel_country'],
      dtype='object')

In [36]:
df_sub = df.loc[:, ["date_time", "orig_destination_distance", 
                    "srch_ci", "srch_co"]].copy()

In [37]:
df_sub = df_sub.rename(columns = {"orig_destination_distance": "dist"})
df_sub.head(1)

    date_time      dist     srch_ci     srch_co
0  2014-07-07  383.3362  2014-08-04  2014-08-08

In [38]:
df_sub["date_time"] = pd.to_datetime(df_sub["date_time"])
df_sub["srch_ci"  ] = pd.to_datetime(df_sub["srch_ci"])
df_sub["srch_co"  ] = pd.to_datetime(df_sub["srch_co"])

In [39]:
df_sub.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000000 entries, 0 to 999999
Data columns (total 4 columns):
date_time    1000000 non-null datetime64[ns]
dist         640342 non-null float64
srch_ci      998867 non-null datetime64[ns]
srch_co      998867 non-null datetime64[ns]
dtypes: datetime64[ns](3), float64(1)
memory usage: 30.5 MB

In [40]:
df_sub["day_left"] = df_sub["srch_ci"] - df_sub["date_time"]
df_sub["nights"  ] = df_sub["srch_co"] - df_sub["srch_ci"]
df_sub.head(2)

   date_time       dist    srch_ci    srch_co day_left nights
0 2014-07-07   383.3362 2014-08-04 2014-08-08  28 days 4 days
1 2014-09-20  2297.5172 2015-01-01 2015-01-03 103 days 2 days

In [41]:
df_sub.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000000 entries, 0 to 999999
Data columns (total 6 columns):
date_time    1000000 non-null datetime64[ns]
dist         640342 non-null float64
srch_ci      998867 non-null datetime64[ns]
srch_co      998867 non-null datetime64[ns]
day_left     998867 non-null timedelta64[ns]
nights       998867 non-null timedelta64[ns]
dtypes: datetime64[ns](3), float64(1), timedelta64[ns](2)
memory usage: 45.8 MB

In [42]:
df_sub.corr()

      dist
dist   1.0

In [43]:
df_sub.loc[df_sub["day_left"].isna(), ]

        date_time       dist srch_ci srch_co day_left nights
511    2013-03-11  4719.3227     NaT     NaT      NaT    NaT
1059   2013-01-28        NaN     NaT     NaT      NaT    NaT
2301   2013-06-26        NaN     NaT     NaT      NaT    NaT
3015   2013-04-02  1117.8937     NaT     NaT      NaT    NaT
3774   2013-03-27        NaN     NaT     NaT      NaT    NaT
...           ...        ...     ...     ...      ...    ...
997240 2013-04-26        NaN     NaT     NaT      NaT    NaT
997362 2014-09-25     3.8518     NaT     NaT      NaT    NaT
997438 2013-08-22        NaN     NaT     NaT      NaT    NaT
999139 2014-05-26    65.2527     NaT     NaT      NaT    NaT
999833 2013-03-22    55.0651     NaT     NaT      NaT    NaT

[1133 rows x 6 columns]

In [44]:
df_sub = df_sub.dropna(how = "any")

In [45]:
df_sub["day_left"] = df_sub["day_left"].dt.days.astype("int")
df_sub["nights"  ] = df_sub["nights"  ].dt.days.astype("int")
df_sub.head(2)

   date_time       dist    srch_ci    srch_co  day_left  nights
0 2014-07-07   383.3362 2014-08-04 2014-08-08        28       4
1 2014-09-20  2297.5172 2015-01-01 2015-01-03       103       2

In [46]:
df_sub.corr()

              dist  day_left    nights
dist      1.000000  0.275855  0.209890
day_left  0.275855  1.000000  0.256427
nights    0.209890  0.256427  1.000000

In [49]:
from scipy.stats import pearsonr

In [51]:
df_sub_notna = df_sub.dropna()
stat, p = pearsonr(df_sub_notna["dist"], df_sub_notna["day_left"])
print(round(stat, 3))
print(round(p, 3)) # <-- 두 변수는 직선적 관계(선형 관계)가 있음.

0.276
0.0

In [47]:
df_sub = df.loc[:, ["date_time", "orig_destination_distance", 
                    "srch_ci", "srch_co"]].copy()
df_sub = df_sub.rename(columns = {"orig_destination_distance": "dist"})
df_sub["date_time"] = pd.to_datetime(df_sub["date_time"])
df_sub["srch_ci"  ] = pd.to_datetime(df_sub["srch_ci"])
df_sub["srch_co"  ] = pd.to_datetime(df_sub["srch_co"])

In [48]:
df_sub["day_left"] = (df_sub["srch_ci"] - df_sub["date_time"]).dt.days
df_sub["nights"  ] = (df_sub["srch_co"] - df_sub["srch_ci"]).dt.days
df_sub.head(2)

   date_time       dist    srch_ci    srch_co  day_left  nights
0 2014-07-07   383.3362 2014-08-04 2014-08-08      28.0     4.0
1 2014-09-20  2297.5172 2015-01-01 2015-01-03     103.0     2.0